/**
 * Функция для вывода на экран результата сложения двух чисел
 */
function add(num1, num2) {
    // Вывести: "num1 + num2 = result"
}

/**
 * Функция для вывода на экран результата вычитания двух чисел
 */
function subtract(num1, num2) {
    // Вывести: "num1 - num2 = result"
}

/**
 * Функция для вывода на экран результата умножения двух чисел
 */
function multiply(num1, num2) {
    // Вывести: "num1 * num2 = result"
}

/**
 * Функция для вывода на экран результата деления двух чисел
 */
function divide(num1, num2) {
    // Вывести: "num1 / num2 = result"
}

/**
 * Функция для вывода на экран результата расчета процента от числа
 */
function percentOf(num, percent) {
    // Вывести: "percent от num = result"
}

/**
 * Функция для вывода на экран результата проверки вхождения числа в диапазон
 */
function isInRange(num, startRange, endRange) {
    // Вывести: "число num находится в диапазоне (startRange, endRange)" или
    // "число num находится вне диапазона (startRange, endRange)"
}

/**
 * Функция для вывода на экран результата проверки четности/нечетности
 */
function isEvenOrOdd(num) {
    // Вывести: "num - четное" или "num - нечетное"
}

/**
 * Функция для вывода на экран результата проверки
 * является ли число простым
 */
function isPrime(num) {
    // Вывести: true если "num простое число" или
    // false если "num непростое число"
}

/**
 * Дополнительные упражнения:
 *
 * 1. Сделать предыдущие функции с пользовательским вводом,
 * используя prompt и alert
 * 2. Написать функцию, которая запрашивает возраст у пользователя и проверяет
 * является ли он совершеннолетним
 * 3. Написать функцию, которая запрашивает возраст у пользователя и выводит
 * сообщение: "Вам 1 год" или "Вам 5 лет", или "Вам 24 года".
 * Сделать проверку на ввод возраста в диапазоне от 0 до 100.
 * 4. Написать функцию, которая выведет все простые числа от 0 до 100
 * 5. Написать функцию для нахождения факториала числа
 * 6. Написать функцию, которая выведет числа Фибоначчи до 100
 * 7. Написать функцию, которая складывает числа по модулю
 */
