[
  {
    "id": 1,
    "title": "Меркурий",
    "description": "Ближайшая к Солнцу планета Солнечной системы, наименьшая из планет земной группы. Названа в честь древнеримского бога торговли — быстрого Меркурия, поскольку она движется по небу быстрее других планет. Её период обращения вокруг Солнца составляет всего 87,97 земных суток — самый короткий среди всех планет Солнечной системы.",
    "image": ""
  },
  {
    "id": 2,
    "title": "Венера",
    "description": "Вторая по удалённости от Солнца и шестая по размеру планета Солнечной системы, наряду с Меркурием, Землёй и Марсом принадлежащая к семейству планет земной группы. Названа в честь древнеримской богини любви Венеры.",
    "image": ""
  },
  {
    "id": 3,
    "title": "Земля",
    "description": "Третья по удалённости от Солнца планета Солнечной системы. Самая плотная, пятая по диаметру и массе среди всех планет и крупнейшая среди планет земной группы, в которую входят также Меркурий, Венера и Марс.",
    "image": ""
  },
  {
    "id": 4,
    "title": "Марс",
    "description": "Четвёртая по удалённости от Солнца и седьмая по размеру планета Солнечной системы; масса планеты составляет 10,7 % массы Земли.Перейти к разделу «#Основные сведения» Названа в честь Марса — древнеримского бога войны, соответствующего древнегреческому Аресу.",
    "image": ""
  },
  {
    "id": 5,
    "title": "Юпитер",
    "description": "Крупнейшая планета Солнечной системы, пятая по удалённости от Солнца. Наряду с Сатурном, Ураном и Нептуном, Юпитер классифицируется как газовый гигант.",
    "image": ""
  },
  {
    "id": 6,
    "title": "Сатурн",
    "description": "Шестая планета по удалённости от Солнца и вторая по размерам планета в Солнечной системе после Юпитера.",
    "image": ""
  },
  {
    "id": 7,
    "title": "Уран",
    "description": "Планета Солнечной системы, седьмая по удалённости от Солнца, третья по диаметру и четвёртая по массе.",
    "image": ""
  },
  {
    "id": 8,
    "title": "Нептун",
    "description": "Восьмая и самая дальняя от Солнца планета Солнечной системы. Его масса превышает массу Земли в 17,2 раза и является третьей среди планет Солнечной системы, а по экваториальному диаметру Нептун занимает четвёртое место, превосходя Землю в 3,9 раза.",
    "image": ""
  }
]