/**
 * Получить на вход массив чисел и
 * вернуть массив, содержащий только положительные числа
 */
function positive(a) {

}

/**
 * Получить на вход массив чисел и
 * вернуть массив, содержащий только четные числа
 */
function even(a) {

}

/**
 * Получить на вход массив чисел и
 * вернуть массив, содержащий все элементы из входного, увеличенные на 1
 */
function increment(a) {

}

/**
 * Получить на вход массив чисел и
 * вернуть массив с числами, входящими в диапазон от -10 до 20
 */
function range(a) {

}

/**
 * Считать через prompt 5 чисел, занести их в массив, передать на вход
 * функции и вернуть произведение всех элементов массива
 */
function multiply(a) {

}

/**
 * Считывать через prompt числа пока не последует пустое значение,
 * занести их в массив, передать на вход
 * функции и вернуть true в случае если все элементы массивы
 * являются положительными числами, в противном случае - false
 */
function checkPositive(a) {

}

/**
 * Получить на вход массив чисел и
 * вернуть наименьший элемент
 */
function arrayMin(a) {

}

/**
 * Получить на вход массив объектов
 * let a = [{value: 100, percent: 10}, {value: 10, percent: 50}];
 * Вернуть массив элементов в котором каждый элемент - это
 * заданный процент от значения, то есть [10, 5]
 */
function percent(a) {

}
