// Написать функцию для сложения двух чисел
function add(num1, num2) {
  // Вывести: "num1 + num2 = result"
}

// Написать функцию для вычитания двух чисел
function subtract(num1, num2) {
  // Вывести: "num1 - num2 = result"
}

// Написать функцию для умножения двух чисел
function multiply(num1, num2) {
  // Вывести: "num1 * num2 = result"
}

// Написать функцию для деления двух чисел
function divide(num1, num2) {
  // Вывести: "num1 / num2 = result"
}

// Написать функцию нахождения процента от числа
function percentOf(num, percent) {
  // Вывести: "percent от num = result"
}

// Написать функцию для проверки вхождения числа в диапазон
function isInRange(num, startRange, endRange) {
  // Вывести: "число num находится в диапазоне (startRange, endRange)" или
  // "число num находится вне диапазона (startRange, endRange)"
}

// Написать функцию для проверки четности или нечетности
function isEvenOrOdd(num, startRange, endRange) {
  // Вывести: "num - четное" или "num - нечетное"
}

function isPrime(num) {
  // Вывести: true если "num простое число" или
  // false если "num непростое число"
}

// Сделать предыдущие функции с пользовательским вводом используя prompt и alert

// Написать функцию, которая запрашивает возраст у пользователя и проверяет, совершеннолетний ли он

/**
 * Написать функцию, которая запрашивает возраст у пользователя и выводит сообщение:
 * "Вам 1 год" или "Вам 5 лет" или "Вам 24 года"
 * Сделать проверку на ввод возраста меньше 0 и больше 100 и вывести соответствующие сообщения
 */

// Написать функцию, которая выведет все простые числа от 0 до 100

// Написать функцию для нахождения факториала числа

// Написать функцию, которая выведет числа Фибоначчи до 100

// Написать функцию, которая складывает числа по модулю

// Добавить проверку валидности данных для предыдущих функций

